jet_in_flow/1_icoFoam_laminar_nonmixing/mesh_5/U1_1_U2_0_5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  Jet-in-crossflow: 2×1×1 box + 0.2×0.2 duct 0.2 m below floor (−y)         |
|  Parametric, human-readable, 3×3 main blocks + 1 duct block                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// ---------------- Parameters ----------------
jetWidth    0.2;    // square jet opening
jetDepth    0.4;    // duct depth below floor
Lx          2.0;    // domain length (x)
Ly          1.0;    // domain height (y)
Lz          1.0;    // domain width  (z)
centerX     1.0;    // jet center (x)
centerZ     0.5;    // jet center (z)

// mesh resolution (balanced & matching at interfaces)
// mesh resolution (make shared-face counts identical)
nx  5;
ny  5;
nz  5;
nJetX  5;
nJetZ  5;
nDuctY 5;

// -------------- Derived coords --------------
x0  0;
x1  #calc "$centerX - 0.5*$jetWidth";
x2  #calc "$centerX + 0.5*$jetWidth";
x3  $Lx;

z0  0;
z1  #calc "$centerZ - 0.5*$jetWidth";
z2  #calc "$centerZ + 0.5*$jetWidth";
z3  $Lz;

y0  0;
y1  $Ly;
yD  #calc "-$jetDepth";

// ---------------- Vertices ------------------
vertices
(
    // floor y=0
    ($x0 $y0 $z0)  //  0
    ($x1 $y0 $z0)  //  1
    ($x2 $y0 $z0)  //  2
    ($x3 $y0 $z0)  //  3

    ($x0 $y0 $z1)  //  4
    ($x1 $y0 $z1)  //  5
    ($x2 $y0 $z1)  //  6
    ($x3 $y0 $z1)  //  7

    ($x0 $y0 $z2)  //  8
    ($x1 $y0 $z2)  //  9
    ($x2 $y0 $z2)  // 10
    ($x3 $y0 $z2)  // 11

    ($x0 $y0 $z3)  // 12
    ($x1 $y0 $z3)  // 13
    ($x2 $y0 $z3)  // 14
    ($x3 $y0 $z3)  // 15

    // top y=1
    ($x0 $y1 $z0)  // 16
    ($x1 $y1 $z0)  // 17
    ($x2 $y1 $z0)  // 18
    ($x3 $y1 $z0)  // 19

    ($x0 $y1 $z1)  // 20
    ($x1 $y1 $z1)  // 21
    ($x2 $y1 $z1)  // 22
    ($x3 $y1 $z1)  // 23

    ($x0 $y1 $z2)  // 24
    ($x1 $y1 $z2)  // 25
    ($x2 $y1 $z2)  // 26
    ($x3 $y1 $z2)  // 27

    ($x0 $y1 $z3)  // 28
    ($x1 $y1 $z3)  // 29
    ($x2 $y1 $z3)  // 30
    ($x3 $y1 $z3)  // 31

    // duct bottom ring at y = yD (below floor opening)
    ($x1 $yD $z1)  // 32
    ($x2 $yD $z1)  // 33
    ($x2 $yD $z2)  // 34
    ($x1 $yD $z2)  // 35
);

// ---------------- Blocks --------------------
blocks
(
    // main box: 3×3 blocks so the centre face matches the jet opening exactly
    hex ( 0  4  5  1  16 20 21 17) ($nx   $ny $nz ) simpleGrading (1 1 1)
    hex ( 1  5  6  2  17 21 22 18) ($nJetX $ny $nJetZ) simpleGrading (1 1 1)
    hex ( 2  6  7  3  18 22 23 19) ($nx   $ny $nz ) simpleGrading (1 1 1)

    hex ( 4  8  9  5  20 24 25 21) ($nx   $ny $nz ) simpleGrading (1 1 1)
    hex ( 5  9 10  6  21 25 26 22) ($nJetX $ny $nJetZ) simpleGrading (1 1 1) // over jet
    hex ( 6 10 11  7  22 26 27 23) ($nx   $ny $nz ) simpleGrading (1 1 1)

    hex ( 8 12 13  9  24 28 29 25) ($nx   $ny $nz ) simpleGrading (1 1 1)
    hex ( 9 13 14 10  25 29 30 26) ($nJetX $ny $nJetZ) simpleGrading (1 1 1)
    hex (10 14 15 11  26 30 31 27) ($nx   $ny $nz ) simpleGrading (1 1 1)

    // duct below floor (vertex order fixed + matching face subdivisions)
    // bottom face: 32 35 34 33   top (floor opening): 5 9 10 6
    hex (32 35 34 33   5 9 10 6)  ($nJetX $nDuctY $nJetZ) simpleGrading (1 1 1)
);

edges ();

// --------------- Boundaries ----------------
boundary
(
    inletMain
    {
        type patch;     // x = 0
        faces ((0 16 20 4) (4 20 24 8) (8 24 28 12));
    }
    outlet
    {
        type patch;     // x = 2
        faces ((3 7 23 19) (7 11 27 23) (11 15 31 27));
    }
    top
    {
        type wall;      // y = 1
        faces
        (
            (16 17 21 20) (20 21 25 24) (24 25 29 28)
            (17 18 22 21) (21 22 26 25) (25 26 30 29)
            (18 19 23 22) (22 23 27 26) (26 27 31 30)
        );
    }
    jetInlet
    {
        type patch;     // bottom of duct (y = yD)
        faces ((32 33 34 35));
    }
    floor
    {
        type wall;      // y = 0 (excluding the hole)
        faces
        (
            (0 1 5 4) (4 5 9 8) (8 9 13 12)
            (1 2 6 5)          (9 10 14 13)
            (2 3 7 6) (6 7 11 10) (10 11 15 14)
        );
    }
    sideWalls
    {
        type wall;      // z = 0 and z = 1
        faces ((0 16 17 1) (1 17 18 2) (2 18 19 3)
               (12 28 29 13) (13 29 30 14) (14 30 31 15));
    }
);

// four duct side faces default to wall:
defaultPatch { name ductWalls; type wall; }

mergePatchPairs();

